SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_eca.h
/**************************************************************************//**
 * @file
 * @brief EFR32BG24 ECA register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32BG24_ECA_H
#define EFR32BG24_ECA_H
#define ECA_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32BG24_ECA ECA
 * @{
 * @brief EFR32BG24 ECA Register Declaration.
 *****************************************************************************/

/** ECA BUF Register Group Declaration. */
typedef struct {
  __IOM uint32_t BASE;                               /**< BUFFER BASE ADDRESS                                */
  __IOM uint32_t LIMITOFFSET;                        /**< Limit Offset                                       */
  __IOM uint32_t WMOFFSET;                           /**< Watermark Offset                                   */
} ECA_BUF_TypeDef;

/** ECA Register Declaration. */
typedef struct {
  __IM uint32_t   IPVERSION;                    /**< IP Version ID                                      */
  __IOM uint32_t  EN;                           /**< Module Enable                                      */
  __IOM uint32_t  SWRST;                        /**< Software Reset                                     */
  __IOM uint32_t  CMD;                          /**< Command                                            */
  __IOM uint32_t  CONTROL;                      /**< Control                                            */
  __IM uint32_t   STATUS;                       /**< Status                                             */
  __IOM uint32_t  IF;                           /**< Interrupt Flag                                     */
  __IOM uint32_t  IEN;                          /**< Interrupt EN                                       */
  __IM uint32_t   DMABUSERRORSTATUS;            /**< DMA Bus Error Status                               */
  ECA_BUF_TypeDef BUF[2U];                      /**<                                                    */
  __IM uint32_t   BUFPTRSTATUS;                 /**< Buffer Pointer Status                              */
  __IOM uint32_t  STARTTRIGCTRL;                /**< Start Trigger Control                              */
  __IOM uint32_t  STOPTRIGCTRL;                 /**< Stop Trigger Control                               */
  __IOM uint32_t  STARTTRIGENMASK;              /**< Start Trigger Enable Mask                          */
  __IOM uint32_t  STARTTRIGREDMASK;             /**< Start Trigger Rising Edge Mask                     */
  __IOM uint32_t  STARTTRIGFEDMASK;             /**< Start Trigger Falling Edge Mask                    */
  __IOM uint32_t  STARTTRIGLVL0MASK;            /**< Start Trigger Level 0 Mask                         */
  __IOM uint32_t  STARTTRIGLVL1MASK;            /**< Start Trigger Level 1 Mask                         */
  __IOM uint32_t  STOPTRIGENMASK;               /**< Stop Trigger Enable Mask                           */
  __IOM uint32_t  STOPTRIGREDMASK;              /**< Stop Trigger Rising Edge Mask                      */
  __IOM uint32_t  STOPTRIGFEDMASK;              /**< Stop Trigger Falling Edge Mask                     */
  __IOM uint32_t  STOPTRIGLVL0MASK;             /**< Stop Trigger Level 0 Mask                          */
  __IOM uint32_t  STOPTRIGLVL1MASK;             /**< Stop Trigger Level 1 Mask                          */
  __IOM uint32_t  CAPTURECTRL;                  /**< Capture Control                                    */
  __IOM uint32_t  CAPTURESTARTDELAY;            /**< Capture Start Delay                                */
  __IOM uint32_t  CAPTURESTOPDELAY;             /**< Capture Stop Delay                                 */
  __IOM uint32_t  CAPTURERATECTRL;              /**< Capture Rate Control                               */
  __IOM uint32_t  PLAYBACKCTRL;                 /**< Playback Control                                   */
  __IOM uint32_t  PLAYBACKRATECTRL;             /**< Playback Rate Control                              */
  __IOM uint32_t  EVENTCNTRCTRL;                /**< Event Counter Control                              */
  __IOM uint32_t  EVENTCNTRCOMPARE;             /**< Event Counter Compare                              */
  __IM uint32_t   EVENTCNTRSTATUS;              /**< Event Counter Status                               */
  uint32_t        RESERVED0[987U];              /**< Reserved for future use                            */
  __IM uint32_t   IPVERSION_SET;                /**< IP Version ID                                      */
  __IOM uint32_t  EN_SET;                       /**< Module Enable                                      */
  __IOM uint32_t  SWRST_SET;                    /**< Software Reset                                     */
  __IOM uint32_t  CMD_SET;                      /**< Command                                            */
  __IOM uint32_t  CONTROL_SET;                  /**< Control                                            */
  __IM uint32_t   STATUS_SET;                   /**< Status                                             */
  __IOM uint32_t  IF_SET;                       /**< Interrupt Flag                                     */
  __IOM uint32_t  IEN_SET;                      /**< Interrupt EN                                       */
  __IM uint32_t   DMABUSERRORSTATUS_SET;        /**< DMA Bus Error Status                               */
  ECA_BUF_TypeDef BUF_SET[2U];                  /**<                                                    */
  __IM uint32_t   BUFPTRSTATUS_SET;             /**< Buffer Pointer Status                              */
  __IOM uint32_t  STARTTRIGCTRL_SET;            /**< Start Trigger Control                              */
  __IOM uint32_t  STOPTRIGCTRL_SET;             /**< Stop Trigger Control                               */
  __IOM uint32_t  STARTTRIGENMASK_SET;          /**< Start Trigger Enable Mask                          */
  __IOM uint32_t  STARTTRIGREDMASK_SET;         /**< Start Trigger Rising Edge Mask                     */
  __IOM uint32_t  STARTTRIGFEDMASK_SET;         /**< Start Trigger Falling Edge Mask                    */
  __IOM uint32_t  STARTTRIGLVL0MASK_SET;        /**< Start Trigger Level 0 Mask                         */
  __IOM uint32_t  STARTTRIGLVL1MASK_SET;        /**< Start Trigger Level 1 Mask                         */
  __IOM uint32_t  STOPTRIGENMASK_SET;           /**< Stop Trigger Enable Mask                           */
  __IOM uint32_t  STOPTRIGREDMASK_SET;          /**< Stop Trigger Rising Edge Mask                      */
  __IOM uint32_t  STOPTRIGFEDMASK_SET;          /**< Stop Trigger Falling Edge Mask                     */
  __IOM uint32_t  STOPTRIGLVL0MASK_SET;         /**< Stop Trigger Level 0 Mask                          */
  __IOM uint32_t  STOPTRIGLVL1MASK_SET;         /**< Stop Trigger Level 1 Mask                          */
  __IOM uint32_t  CAPTURECTRL_SET;              /**< Capture Control                                    */
  __IOM uint32_t  CAPTURESTARTDELAY_SET;        /**< Capture Start Delay                                */
  __IOM uint32_t  CAPTURESTOPDELAY_SET;         /**< Capture Stop Delay                                 */
  __IOM uint32_t  CAPTURERATECTRL_SET;          /**< Capture Rate Control                               */
  __IOM uint32_t  PLAYBACKCTRL_SET;             /**< Playback Control                                   */
  __IOM uint32_t  PLAYBACKRATECTRL_SET;         /**< Playback Rate Control                              */
  __IOM uint32_t  EVENTCNTRCTRL_SET;            /**< Event Counter Control                              */
  __IOM uint32_t  EVENTCNTRCOMPARE_SET;         /**< Event Counter Compare                              */
  __IM uint32_t   EVENTCNTRSTATUS_SET;          /**< Event Counter Status                               */
  uint32_t        RESERVED1[987U];              /**< Reserved for future use                            */
  __IM uint32_t   IPVERSION_CLR;                /**< IP Version ID                                      */
  __IOM uint32_t  EN_CLR;                       /**< Module Enable                                      */
  __IOM uint32_t  SWRST_CLR;                    /**< Software Reset                                     */
  __IOM uint32_t  CMD_CLR;                      /**< Command                                            */
  __IOM uint32_t  CONTROL_CLR;                  /**< Control                                            */
  __IM uint32_t   STATUS_CLR;                   /**< Status                                             */
  __IOM uint32_t  IF_CLR;                       /**< Interrupt Flag                                     */
  __IOM uint32_t  IEN_CLR;                      /**< Interrupt EN                                       */
  __IM uint32_t   DMABUSERRORSTATUS_CLR;        /**< DMA Bus Error Status                               */
  ECA_BUF_TypeDef BUF_CLR[2U];                  /**<                                                    */
  __IM uint32_t   BUFPTRSTATUS_CLR;             /**< Buffer Pointer Status                              */
  __IOM uint32_t  STARTTRIGCTRL_CLR;            /**< Start Trigger Control                              */
  __IOM uint32_t  STOPTRIGCTRL_CLR;             /**< Stop Trigger Control                               */
  __IOM uint32_t  STARTTRIGENMASK_CLR;          /**< Start Trigger Enable Mask                          */
  __IOM uint32_t  STARTTRIGREDMASK_CLR;         /**< Start Trigger Rising Edge Mask                     */
  __IOM uint32_t  STARTTRIGFEDMASK_CLR;         /**< Start Trigger Falling Edge Mask                    */
  __IOM uint32_t  STARTTRIGLVL0MASK_CLR;        /**< Start Trigger Level 0 Mask                         */
  __IOM uint32_t  STARTTRIGLVL1MASK_CLR;        /**< Start Trigger Level 1 Mask                         */
  __IOM uint32_t  STOPTRIGENMASK_CLR;           /**< Stop Trigger Enable Mask                           */
  __IOM uint32_t  STOPTRIGREDMASK_CLR;          /**< Stop Trigger Rising Edge Mask                      */
  __IOM uint32_t  STOPTRIGFEDMASK_CLR;          /**< Stop Trigger Falling Edge Mask                     */
  __IOM uint32_t  STOPTRIGLVL0MASK_CLR;         /**< Stop Trigger Level 0 Mask                          */
  __IOM uint32_t  STOPTRIGLVL1MASK_CLR;         /**< Stop Trigger Level 1 Mask                          */
  __IOM uint32_t  CAPTURECTRL_CLR;              /**< Capture Control                                    */
  __IOM uint32_t  CAPTURESTARTDELAY_CLR;        /**< Capture Start Delay                                */
  __IOM uint32_t  CAPTURESTOPDELAY_CLR;         /**< Capture Stop Delay                                 */
  __IOM uint32_t  CAPTURERATECTRL_CLR;          /**< Capture Rate Control                               */
  __IOM uint32_t  PLAYBACKCTRL_CLR;             /**< Playback Control                                   */
  __IOM uint32_t  PLAYBACKRATECTRL_CLR;         /**< Playback Rate Control                              */
  __IOM uint32_t  EVENTCNTRCTRL_CLR;            /**< Event Counter Control                              */
  __IOM uint32_t  EVENTCNTRCOMPARE_CLR;         /**< Event Counter Compare                              */
  __IM uint32_t   EVENTCNTRSTATUS_CLR;          /**< Event Counter Status                               */
  uint32_t        RESERVED2[987U];              /**< Reserved for future use                            */
  __IM uint32_t   IPVERSION_TGL;                /**< IP Version ID                                      */
  __IOM uint32_t  EN_TGL;                       /**< Module Enable                                      */
  __IOM uint32_t  SWRST_TGL;                    /**< Software Reset                                     */
  __IOM uint32_t  CMD_TGL;                      /**< Command                                            */
  __IOM uint32_t  CONTROL_TGL;                  /**< Control                                            */
  __IM uint32_t   STATUS_TGL;                   /**< Status                                             */
  __IOM uint32_t  IF_TGL;                       /**< Interrupt Flag                                     */
  __IOM uint32_t  IEN_TGL;                      /**< Interrupt EN                                       */
  __IM uint32_t   DMABUSERRORSTATUS_TGL;        /**< DMA Bus Error Status                               */
  ECA_BUF_TypeDef BUF_TGL[2U];                  /**<                                                    */
  __IM uint32_t   BUFPTRSTATUS_TGL;             /**< Buffer Pointer Status                              */
  __IOM uint32_t  STARTTRIGCTRL_TGL;            /**< Start Trigger Control                              */
  __IOM uint32_t  STOPTRIGCTRL_TGL;             /**< Stop Trigger Control                               */
  __IOM uint32_t  STARTTRIGENMASK_TGL;          /**< Start Trigger Enable Mask                          */
  __IOM uint32_t  STARTTRIGREDMASK_TGL;         /**< Start Trigger Rising Edge Mask                     */
  __IOM uint32_t  STARTTRIGFEDMASK_TGL;         /**< Start Trigger Falling Edge Mask                    */
  __IOM uint32_t  STARTTRIGLVL0MASK_TGL;        /**< Start Trigger Level 0 Mask                         */
  __IOM uint32_t  STARTTRIGLVL1MASK_TGL;        /**< Start Trigger Level 1 Mask                         */
  __IOM uint32_t  STOPTRIGENMASK_TGL;           /**< Stop Trigger Enable Mask                           */
  __IOM uint32_t  STOPTRIGREDMASK_TGL;          /**< Stop Trigger Rising Edge Mask                      */
  __IOM uint32_t  STOPTRIGFEDMASK_TGL;          /**< Stop Trigger Falling Edge Mask                     */
  __IOM uint32_t  STOPTRIGLVL0MASK_TGL;         /**< Stop Trigger Level 0 Mask                          */
  __IOM uint32_t  STOPTRIGLVL1MASK_TGL;         /**< Stop Trigger Level 1 Mask                          */
  __IOM uint32_t  CAPTURECTRL_TGL;              /**< Capture Control                                    */
  __IOM uint32_t  CAPTURESTARTDELAY_TGL;        /**< Capture Start Delay                                */
  __IOM uint32_t  CAPTURESTOPDELAY_TGL;         /**< Capture Stop Delay                                 */
  __IOM uint32_t  CAPTURERATECTRL_TGL;          /**< Capture Rate Control                               */
  __IOM uint32_t  PLAYBACKCTRL_TGL;             /**< Playback Control                                   */
  __IOM uint32_t  PLAYBACKRATECTRL_TGL;         /**< Playback Rate Control                              */
  __IOM uint32_t  EVENTCNTRCTRL_TGL;            /**< Event Counter Control                              */
  __IOM uint32_t  EVENTCNTRCOMPARE_TGL;         /**< Event Counter Compare                              */
  __IM uint32_t   EVENTCNTRSTATUS_TGL;          /**< Event Counter Status                               */
} ECA_TypeDef;
/** @} End of group EFR32BG24_ECA */

/**************************************************************************//**
 * @addtogroup EFR32BG24_ECA
 * @{
 * @defgroup EFR32BG24_ECA_BitFields ECA Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for ECA IPVERSION */
#define _ECA_IPVERSION_RESETVALUE                      0x00000001UL                            /**< Default value for ECA_IPVERSION             */
#define _ECA_IPVERSION_MASK                            0xFFFFFFFFUL                            /**< Mask for ECA_IPVERSION                      */
#define _ECA_IPVERSION_IPVERSION_SHIFT                 0                                       /**< Shift value for ECA_IPVERSION               */
#define _ECA_IPVERSION_IPVERSION_MASK                  0xFFFFFFFFUL                            /**< Bit mask for ECA_IPVERSION                  */
#define _ECA_IPVERSION_IPVERSION_DEFAULT               0x00000001UL                            /**< Mode DEFAULT for ECA_IPVERSION              */
#define ECA_IPVERSION_IPVERSION_DEFAULT                (_ECA_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_IPVERSION      */

/* Bit fields for ECA EN */
#define _ECA_EN_RESETVALUE                             0x00000000UL                     /**< Default value for ECA_EN                    */
#define _ECA_EN_MASK                                   0x00000003UL                     /**< Mask for ECA_EN                             */
#define ECA_EN_EN                                      (0x1UL << 0)                     /**< Module Enable                               */
#define _ECA_EN_EN_SHIFT                               0                                /**< Shift value for ECA_EN                      */
#define _ECA_EN_EN_MASK                                0x1UL                            /**< Bit mask for ECA_EN                         */
#define _ECA_EN_EN_DEFAULT                             0x00000000UL                     /**< Mode DEFAULT for ECA_EN                     */
#define ECA_EN_EN_DEFAULT                              (_ECA_EN_EN_DEFAULT << 0)        /**< Shifted mode DEFAULT for ECA_EN             */
#define ECA_EN_DISABLING                               (0x1UL << 1)                     /**< Disablement Busy Status                     */
#define _ECA_EN_DISABLING_SHIFT                        1                                /**< Shift value for ECA_DISABLING               */
#define _ECA_EN_DISABLING_MASK                         0x2UL                            /**< Bit mask for ECA_DISABLING                  */
#define _ECA_EN_DISABLING_DEFAULT                      0x00000000UL                     /**< Mode DEFAULT for ECA_EN                     */
#define ECA_EN_DISABLING_DEFAULT                       (_ECA_EN_DISABLING_DEFAULT << 1) /**< Shifted mode DEFAULT for ECA_EN             */

/* Bit fields for ECA SWRST */
#define _ECA_SWRST_RESETVALUE                          0x00000000UL                        /**< Default value for ECA_SWRST                 */
#define _ECA_SWRST_MASK                                0x00000003UL                        /**< Mask for ECA_SWRST                          */
#define ECA_SWRST_SWRST                                (0x1UL << 0)                        /**< Software Reset Command                      */
#define _ECA_SWRST_SWRST_SHIFT                         0                                   /**< Shift value for ECA_SWRST                   */
#define _ECA_SWRST_SWRST_MASK                          0x1UL                               /**< Bit mask for ECA_SWRST                      */
#define _ECA_SWRST_SWRST_DEFAULT                       0x00000000UL                        /**< Mode DEFAULT for ECA_SWRST                  */
#define ECA_SWRST_SWRST_DEFAULT                        (_ECA_SWRST_SWRST_DEFAULT << 0)     /**< Shifted mode DEFAULT for ECA_SWRST          */
#define ECA_SWRST_RESETTING                            (0x1UL << 1)                        /**< Software Reset Busy Status                  */
#define _ECA_SWRST_RESETTING_SHIFT                     1                                   /**< Shift value for ECA_RESETTING               */
#define _ECA_SWRST_RESETTING_MASK                      0x2UL                               /**< Bit mask for ECA_RESETTING                  */
#define _ECA_SWRST_RESETTING_DEFAULT                   0x00000000UL                        /**< Mode DEFAULT for ECA_SWRST                  */
#define ECA_SWRST_RESETTING_DEFAULT                    (_ECA_SWRST_RESETTING_DEFAULT << 1) /**< Shifted mode DEFAULT for ECA_SWRST          */

