SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_eca.h
/* Bit fields for ECA IEN */
#define _ECA_IEN_RESETVALUE                            0x00000000UL                           /**< Default value for ECA_IEN                   */
#define _ECA_IEN_MASK                                  0x00003FFFUL                           /**< Mask for ECA_IEN                            */
#define ECA_IEN_BUF0WMIND                              (0x1UL << 0)                           /**< New BitField                                */
#define _ECA_IEN_BUF0WMIND_SHIFT                       0                                      /**< Shift value for ECA_BUF0WMIND               */
#define _ECA_IEN_BUF0WMIND_MASK                        0x1UL                                  /**< Bit mask for ECA_BUF0WMIND                  */
#define _ECA_IEN_BUF0WMIND_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_BUF0WMIND_DEFAULT                      (_ECA_IEN_BUF0WMIND_DEFAULT << 0)      /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_BUF1WMIND                              (0x1UL << 1)                           /**< New BitField                                */
#define _ECA_IEN_BUF1WMIND_SHIFT                       1                                      /**< Shift value for ECA_BUF1WMIND               */
#define _ECA_IEN_BUF1WMIND_MASK                        0x2UL                                  /**< Bit mask for ECA_BUF1WMIND                  */
#define _ECA_IEN_BUF1WMIND_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_BUF1WMIND_DEFAULT                      (_ECA_IEN_BUF1WMIND_DEFAULT << 1)      /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_BUF0FULLIND                            (0x1UL << 2)                           /**< New BitField                                */
#define _ECA_IEN_BUF0FULLIND_SHIFT                     2                                      /**< Shift value for ECA_BUF0FULLIND             */
#define _ECA_IEN_BUF0FULLIND_MASK                      0x4UL                                  /**< Bit mask for ECA_BUF0FULLIND                */
#define _ECA_IEN_BUF0FULLIND_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_BUF0FULLIND_DEFAULT                    (_ECA_IEN_BUF0FULLIND_DEFAULT << 2)    /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_BUF1FULLIND                            (0x1UL << 3)                           /**< New BitField                                */
#define _ECA_IEN_BUF1FULLIND_SHIFT                     3                                      /**< Shift value for ECA_BUF1FULLIND             */
#define _ECA_IEN_BUF1FULLIND_MASK                      0x8UL                                  /**< Bit mask for ECA_BUF1FULLIND                */
#define _ECA_IEN_BUF1FULLIND_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_BUF1FULLIND_DEFAULT                    (_ECA_IEN_BUF1FULLIND_DEFAULT << 3)    /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_STARTTRIG                              (0x1UL << 4)                           /**< New BitField                                */
#define _ECA_IEN_STARTTRIG_SHIFT                       4                                      /**< Shift value for ECA_STARTTRIG               */
#define _ECA_IEN_STARTTRIG_MASK                        0x10UL                                 /**< Bit mask for ECA_STARTTRIG                  */
#define _ECA_IEN_STARTTRIG_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_STARTTRIG_DEFAULT                      (_ECA_IEN_STARTTRIG_DEFAULT << 4)      /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_STOPTRIG                               (0x1UL << 5)                           /**< New BitField                                */
#define _ECA_IEN_STOPTRIG_SHIFT                        5                                      /**< Shift value for ECA_STOPTRIG                */
#define _ECA_IEN_STOPTRIG_MASK                         0x20UL                                 /**< Bit mask for ECA_STOPTRIG                   */
#define _ECA_IEN_STOPTRIG_DEFAULT                      0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_STOPTRIG_DEFAULT                       (_ECA_IEN_STOPTRIG_DEFAULT << 5)       /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_CAPTURESTART                           (0x1UL << 6)                           /**< New BitField                                */
#define _ECA_IEN_CAPTURESTART_SHIFT                    6                                      /**< Shift value for ECA_CAPTURESTART            */
#define _ECA_IEN_CAPTURESTART_MASK                     0x40UL                                 /**< Bit mask for ECA_CAPTURESTART               */
#define _ECA_IEN_CAPTURESTART_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_CAPTURESTART_DEFAULT                   (_ECA_IEN_CAPTURESTART_DEFAULT << 6)   /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_CAPTUREEND                             (0x1UL << 7)                           /**< New BitField                                */
#define _ECA_IEN_CAPTUREEND_SHIFT                      7                                      /**< Shift value for ECA_CAPTUREEND              */
#define _ECA_IEN_CAPTUREEND_MASK                       0x80UL                                 /**< Bit mask for ECA_CAPTUREEND                 */
#define _ECA_IEN_CAPTUREEND_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_CAPTUREEND_DEFAULT                     (_ECA_IEN_CAPTUREEND_DEFAULT << 7)     /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_PLAYBACKSTART                          (0x1UL << 8)                           /**< New BitField                                */
#define _ECA_IEN_PLAYBACKSTART_SHIFT                   8                                      /**< Shift value for ECA_PLAYBACKSTART           */
#define _ECA_IEN_PLAYBACKSTART_MASK                    0x100UL                                /**< Bit mask for ECA_PLAYBACKSTART              */
#define _ECA_IEN_PLAYBACKSTART_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_PLAYBACKSTART_DEFAULT                  (_ECA_IEN_PLAYBACKSTART_DEFAULT << 8)  /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_PLAYBACKEND                            (0x1UL << 9)                           /**< New BitField                                */
#define _ECA_IEN_PLAYBACKEND_SHIFT                     9                                      /**< Shift value for ECA_PLAYBACKEND             */
#define _ECA_IEN_PLAYBACKEND_MASK                      0x200UL                                /**< Bit mask for ECA_PLAYBACKEND                */
#define _ECA_IEN_PLAYBACKEND_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_PLAYBACKEND_DEFAULT                    (_ECA_IEN_PLAYBACKEND_DEFAULT << 9)    /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_EVENTCNTRCOMP                          (0x1UL << 10)                          /**< New BitField                                */
#define _ECA_IEN_EVENTCNTRCOMP_SHIFT                   10                                     /**< Shift value for ECA_EVENTCNTRCOMP           */
#define _ECA_IEN_EVENTCNTRCOMP_MASK                    0x400UL                                /**< Bit mask for ECA_EVENTCNTRCOMP              */
#define _ECA_IEN_EVENTCNTRCOMP_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_EVENTCNTRCOMP_DEFAULT                  (_ECA_IEN_EVENTCNTRCOMP_DEFAULT << 10) /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_FIFOORERROR                            (0x1UL << 11)                          /**< New BitField                                */
#define _ECA_IEN_FIFOORERROR_SHIFT                     11                                     /**< Shift value for ECA_FIFOORERROR             */
#define _ECA_IEN_FIFOORERROR_MASK                      0x800UL                                /**< Bit mask for ECA_FIFOORERROR                */
#define _ECA_IEN_FIFOORERROR_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_FIFOORERROR_DEFAULT                    (_ECA_IEN_FIFOORERROR_DEFAULT << 11)   /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_FIFOURERROR                            (0x1UL << 12)                          /**< New BitField                                */
#define _ECA_IEN_FIFOURERROR_SHIFT                     12                                     /**< Shift value for ECA_FIFOURERROR             */
#define _ECA_IEN_FIFOURERROR_MASK                      0x1000UL                               /**< Bit mask for ECA_FIFOURERROR                */
#define _ECA_IEN_FIFOURERROR_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_FIFOURERROR_DEFAULT                    (_ECA_IEN_FIFOURERROR_DEFAULT << 12)   /**< Shifted mode DEFAULT for ECA_IEN            */
#define ECA_IEN_DMABUSERROR                            (0x1UL << 13)                          /**< New BitField                                */
#define _ECA_IEN_DMABUSERROR_SHIFT                     13                                     /**< Shift value for ECA_DMABUSERROR             */
#define _ECA_IEN_DMABUSERROR_MASK                      0x2000UL                               /**< Bit mask for ECA_DMABUSERROR                */
#define _ECA_IEN_DMABUSERROR_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for ECA_IEN                    */
#define ECA_IEN_DMABUSERROR_DEFAULT                    (_ECA_IEN_DMABUSERROR_DEFAULT << 13)   /**< Shifted mode DEFAULT for ECA_IEN            */

/* Bit fields for ECA DMABUSERRORSTATUS */
#define _ECA_DMABUSERRORSTATUS_RESETVALUE              0x00000000UL                               /**< Default value for ECA_DMABUSERRORSTATUS     */
#define _ECA_DMABUSERRORSTATUS_MASK                    0xFFFFFFFFUL                               /**< Mask for ECA_DMABUSERRORSTATUS              */
#define _ECA_DMABUSERRORSTATUS_ADDR_SHIFT              0                                          /**< Shift value for ECA_ADDR                    */
#define _ECA_DMABUSERRORSTATUS_ADDR_MASK               0xFFFFFFFFUL                               /**< Bit mask for ECA_ADDR                       */
#define _ECA_DMABUSERRORSTATUS_ADDR_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for ECA_DMABUSERRORSTATUS      */
#define ECA_DMABUSERRORSTATUS_ADDR_DEFAULT             (_ECA_DMABUSERRORSTATUS_ADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_DMABUSERRORSTATUS*/

/* Bit fields for ECA BUF_BASE */
#define _ECA_BUF_BASE_RESETVALUE                       0x00000000UL                      /**< Default value for ECA_BUF_BASE              */
#define _ECA_BUF_BASE_MASK                             0xFFFFFFFFUL                      /**< Mask for ECA_BUF_BASE                       */
#define _ECA_BUF_BASE_BASE_SHIFT                       0                                 /**< Shift value for ECA_BASE                    */
#define _ECA_BUF_BASE_BASE_MASK                        0xFFFFFFFFUL                      /**< Bit mask for ECA_BASE                       */
#define _ECA_BUF_BASE_BASE_DEFAULT                     0x00000000UL                      /**< Mode DEFAULT for ECA_BUF_BASE               */
#define ECA_BUF_BASE_BASE_DEFAULT                      (_ECA_BUF_BASE_BASE_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_BUF_BASE       */

/* Bit fields for ECA BUF_LIMITOFFSET */
#define _ECA_BUF_LIMITOFFSET_RESETVALUE                0x00000000UL                               /**< Default value for ECA_BUF_LIMITOFFSET       */
#define _ECA_BUF_LIMITOFFSET_MASK                      0x0007FFFCUL                               /**< Mask for ECA_BUF_LIMITOFFSET                */
#define _ECA_BUF_LIMITOFFSET_OFFSET_SHIFT              2                                          /**< Shift value for ECA_OFFSET                  */
#define _ECA_BUF_LIMITOFFSET_OFFSET_MASK               0x7FFFCUL                                  /**< Bit mask for ECA_OFFSET                     */
#define _ECA_BUF_LIMITOFFSET_OFFSET_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for ECA_BUF_LIMITOFFSET        */
#define ECA_BUF_LIMITOFFSET_OFFSET_DEFAULT             (_ECA_BUF_LIMITOFFSET_OFFSET_DEFAULT << 2) /**< Shifted mode DEFAULT for ECA_BUF_LIMITOFFSET*/

